zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Source/system_M55M1.c
/**************************************************************************//**
 * @file     system_M55M1.c
 * @version  V1.00
 * @brief    CMSIS Device System Source File for NuMicro M55M1
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)       // ARM Compiler 6
    #include <arm_cmse.h>
#endif

#include "NuMicro.h"
#include "scu/mpc_sie_drv.h"

#ifndef FMC_INIT_MIRROR_BOUND
    #define FMC_INIT_MIRROR_BOUND       0x0
#endif

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/
extern const VECTOR_TABLE_Type __VECTOR_TABLE[];
extern const VECTOR_TABLE_Type DTCM_VECTOR_TABLE[];

/*----------------------------------------------------------------------------
  System Core Clock Variable
 *----------------------------------------------------------------------------*/
uint32_t SystemCoreClock = __HSI;                /*!< System Clock Frequency (Core Clock) */
uint32_t CyclesPerUs     = (__HSI / 1000000UL);  /*!< Cycles per micro second             */
uint32_t PllClock        = __HSI;                /*!< PLL Output Clock Frequency          */
uint32_t g_u32NonCacheableBase  = 0,
         g_u32NonCacheableLimit = 0;

void TZ_SAU_Setup(void);
void FMC_NSCBA_Setup(void);
void SCU_Setup(void);
void NSC_Init(uint32_t u32RegionIdx);

#if defined (__ARM_FEATURE_CMSE) &&  (__ARM_FEATURE_CMSE == 3U)
static const char *sc_astrMasterName[] =
{
    "CPU",   "PDMA0", "PDMA1",  "USBH0", NULL,   "HSUSBH", "HSUSBD", "SDH0",
    "SDH1",  "EMAC",  "CRYPTO", "CRC",   "GDMA", "NPU",    "LPPDMA", "CCAP",
    "SPIM0"
};
static const char *sc_astrMasterVioName[] =
{
    "GDMA",  "PDMA0", "PDMA1",  "USBH0", NULL,     "HSUSBH", "HSUSBD", "SDH0",
    "SDH1",  "EMAC",  "CRYPTO", "CRC",   "LPPDMA", "CCAP",   "NPU0",   "NPU1",
    "SPIM0"
};
static const char *sc_astrSlaveName[]  =
{
    "APB0",   "APB1",   "APB2",   "APB3",   "APB4", "APB5", NULL, NULL,
    "D0PPC0", "D1PPC0", "D1PPC1", "D2PPC0", NULL,   NULL,   NULL, NULL,
    "EBI",    "Flash"
};
#endif

/*----------------------------------------------------------------------------
  System Core Clock update function
 *----------------------------------------------------------------------------*/
void SystemCoreClockUpdate(void)
{
    uint32_t u32Freq;

    u32Freq = CLK_SystemClockUpdate();

    /* Update System Core Clock */
    SystemCoreClock = u32Freq;

    CyclesPerUs = (SystemCoreClock + 500000UL) / 1000000UL;
}

#ifndef NVT_DBG_UART_OFF
/**
 * @brief  Set debug UART multi-function pins
 *
 * @param  None
 *
 * @return None
 */
__WEAK void SetDebugUartMFP(void)
{
#if (!defined(DEBUG_ENABLE_SEMIHOST) || (DEBUG_ENABLE_SEMIHOST == 1)) && !defined(OS_USE_SEMIHOSTING)

#if(USING_UART0  == 1)
    /* Set PB12 as UART0 RXD and PB13 as UART0 TXD */
    SET_UART0_RXD_PB12();
    SET_UART0_TXD_PB13();
#else
    /* Set GPH5 as UART6 RXD and GPH4 as UART6 TXD */
    SET_UART6_RXD_PH5();
    SET_UART6_TXD_PH4();
#endif

#endif
}

/**
 * @brief    Set debug UART clock source and enable module clock
 *
 * @param    None
 *
 * @return   None
 */
__WEAK void SetDebugUartCLK(void)
{
#if (!defined(DEBUG_ENABLE_SEMIHOST) || (DEBUG_ENABLE_SEMIHOST == 1)) && !defined(OS_USE_SEMIHOSTING)
    /* Enable External HXT clock */
    CLK_EnableXtalRC(CLK_SRCCTL_HXTEN_Msk);

    /* Waiting for HXT clock ready */
    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);
#if(USING_UART0  == 1)
    /* Select UART0 clock source from HIRC */
    CLK_SetModuleClock(DEBUG_PORT_MODULE, CLK_UARTSEL0_UART0SEL_HIRC, CLK_UARTDIV0_UART0DIV(1));
#else
    /* Select UART6 clock source from HIRC */
    CLK_SetModuleClock(DEBUG_PORT_MODULE, CLK_UARTSEL0_UART6SEL_HIRC, CLK_UARTDIV0_UART6DIV(1));
#endif

    /* Enable UART clock */
    CLK_EnableModuleClock(DEBUG_PORT_MODULE);

    /* Reset UART module */
    SYS_ResetModule(DEBUG_PORT_RST);
#endif
}

/**
 * @brief    Initialize debug UART to 115200-8n1
 *
 * @param    None
 *
 * @return   None
 */
__WEAK void InitDebugUart(void)
{
#if (!defined(DEBUG_ENABLE_SEMIHOST) || (DEBUG_ENABLE_SEMIHOST == 1)) && !defined(OS_USE_SEMIHOSTING)
    /* Init UART to 115200-8n1 for print message */
    UART_Open(DEBUG_PORT, 115200);
#endif
}
#endif /* NVT_DBG_UART_OFF */

/**
 * @brief    Init MPU Region
 *
 * @param    psMPURegion        User defined MPU region configuration table
 * @param    u32RegionCnt       Region count of psMPURegion
 *
 * @return   0: Init success
 *           < 0: Init failed
 * @details  Initialize MPU Region according to mpu_config_M55M1.h and user defined table
 */
__WEAK int32_t InitPreDefMPURegion(const ARM_MPU_Region_t *psMPURegion, uint32_t u32RegionCnt)
{
    int32_t i32RetCode = 0;

    int32_t i32RegionIdx = 0;
    const uint8_t WTRA   = ARM_MPU_ATTR_MEMORY_(1, 0, 1, 0); // Non-transient, Write-Through, Read-allocate, Not Write-allocate
    const uint8_t WBWARA = ARM_MPU_ATTR_MEMORY_(1, 1, 1, 1); // Non-transient, Write-Back, Read-allocate, Write-allocate

    NVT_UNUSED(WTRA);
    NVT_UNUSED(WBWARA);

#if (MPU_INIT_MEM_ATTRS & BIT0)
    ARM_MPU_SetMemAttr(eMPU_ATTR_DEV_nGnRnE,        ARM_MPU_ATTR(ARM_MPU_ATTR_DEVICE_nGnRnE, ARM_MPU_ATTR_DEVICE_nGnRnE));
#endif

#if (MPU_INIT_MEM_ATTRS & BIT1)
    ARM_MPU_SetMemAttr(eMPU_ATTR_DEV_nGnRE,         ARM_MPU_ATTR(ARM_MPU_ATTR_DEVICE_nGnRE,  ARM_MPU_ATTR_DEVICE_nGnRnE));
#endif

#if (MPU_INIT_MEM_ATTRS & BIT2)
    ARM_MPU_SetMemAttr(eMPU_ATTR_DEV_nGRE,          ARM_MPU_ATTR(ARM_MPU_ATTR_DEVICE_nGRE,   ARM_MPU_ATTR_DEVICE_nGRE));
#endif

#if (MPU_INIT_MEM_ATTRS & BIT3)
    ARM_MPU_SetMemAttr(eMPU_ATTR_DEV_GRE,           ARM_MPU_ATTR(ARM_MPU_ATTR_DEVICE_GRE,    ARM_MPU_ATTR_DEVICE_GRE));
#endif

#if (MPU_INIT_MEM_ATTRS & BIT4)
    ARM_MPU_SetMemAttr(eMPU_ATTR_NON_CACHEABLE,     ARM_MPU_ATTR(ARM_MPU_ATTR_NON_CACHEABLE, ARM_MPU_ATTR_NON_CACHEABLE));
#endif

#if (MPU_INIT_MEM_ATTRS & BIT5)
    ARM_MPU_SetMemAttr(eMPU_ATTR_CACHEABLE_WTRA,    ARM_MPU_ATTR(WTRA, WTRA));
#endif

#if (MPU_INIT_MEM_ATTRS & BIT6)
    ARM_MPU_SetMemAttr(eMPU_ATTR_CACHEABLE_WBWARA,  ARM_MPU_ATTR(WBWARA, WBWARA));
#endif

