zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Source/system_M55M1.c
    i32RegionIdx = 0;

#if (MPU_INIT_REGIONS != 0)

    if (MPU_INIT_REGION(0) != 0)
    {
        //printf("[0] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(0), MPU_INIT_LIMIT(0));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(0, MPU_INIT_BASE(0)), ARM_MPU_RLAR(MPU_INIT_LIMIT(0), MPU_MEM_ATTR(0)));
        i32RegionIdx++;
    }

    if (MPU_INIT_REGION(1) != 0)
    {
        //printf("[1] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(1), MPU_INIT_LIMIT(1));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(1, MPU_INIT_BASE(1)), ARM_MPU_RLAR(MPU_INIT_LIMIT(1), MPU_MEM_ATTR(1)));
        i32RegionIdx++;
    }

    if (MPU_INIT_REGION(2) != 0)
    {
        //printf("[2] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(2), MPU_INIT_LIMIT(2));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(2, MPU_INIT_BASE(2)), ARM_MPU_RLAR(MPU_INIT_LIMIT(2), MPU_MEM_ATTR(2)));
        i32RegionIdx++;
    }

    if (MPU_INIT_REGION(3) != 0)
    {
        //printf("[3] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(3), MPU_INIT_LIMIT(3));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(3, MPU_INIT_BASE(3)), ARM_MPU_RLAR(MPU_INIT_LIMIT(3), MPU_MEM_ATTR(3)));
        i32RegionIdx++;
    }

    if (MPU_INIT_REGION(4) != 0)
    {
        //printf("[4] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(4), MPU_INIT_LIMIT(4));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(4, MPU_INIT_BASE(4)), ARM_MPU_RLAR(MPU_INIT_LIMIT(4), MPU_MEM_ATTR(4)));
        i32RegionIdx++;
    }

    if (MPU_INIT_REGION(5) != 0)
    {
        //printf("[5] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(5), MPU_INIT_LIMIT(5));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(5, MPU_INIT_BASE(5)), ARM_MPU_RLAR(MPU_INIT_LIMIT(5), MPU_MEM_ATTR(5)));
        i32RegionIdx++;
    }

    if (MPU_INIT_REGION(6) != 0)
    {
        //printf("[6] Base: 0x%08X, Limit: 0x%08X\n", MPU_INIT_BASE(6), MPU_INIT_LIMIT(6));
        ARM_MPU_SetRegion(i32RegionIdx, MPU_INIT_RBAR(6, MPU_INIT_BASE(6)), ARM_MPU_RLAR(MPU_INIT_LIMIT(6), MPU_MEM_ATTR(6)));
        i32RegionIdx++;
    }

#endif  // (MPU_INIT_REGIONS != 0)

    if (psMPURegion != NULL)
    {
        //printf("u32RegionCnt: %d, (MPU_REGIONS_MAX - i32RegionIdx): %d\n", u32RegionCnt, (MPU_REGIONS_MAX - i32RegionIdx));

        if (u32RegionCnt < (MPU_REGIONS_MAX - i32RegionIdx - 1))
            ARM_MPU_Load(i32RegionIdx, psMPURegion, u32RegionCnt);
        else
            return -1;
    }

    // Enable MPU with default priv access to all other regions
    ARM_MPU_Enable(MPU_CTRL_PRIVDEFENA_Msk);

#if (NVT_DCACHE_ON == 1)

#if defined (__ICCARM__)
    __WEAK extern uint32_t NonCacheable_start, NonCacheable_end;

    if (((uint32_t)&NonCacheable_start) && ((uint32_t)&NonCacheable_end))
    {
        g_u32NonCacheableBase  = (uint32_t)&NonCacheable_start;
        g_u32NonCacheableLimit = (uint32_t)&NonCacheable_end;
    }

#elif defined(__ARMCC_VERSION)
    __WEAK extern uint32_t Image$$SRAM_NONCACHEABLE$$Base, Image$$SRAM_NONCACHEABLE_END$$Base;

    if (((uint32_t)&Image$$SRAM_NONCACHEABLE$$Base) && ((uint32_t)&Image$$SRAM_NONCACHEABLE_END$$Base))
    {
        g_u32NonCacheableBase  = (uint32_t)&Image$$SRAM_NONCACHEABLE$$Base;
        g_u32NonCacheableLimit = DCACHE_ALIGN_LINE_SIZE((uint32_t)&Image$$SRAM_NONCACHEABLE_END$$Base) - 1;
    }

#else
    __WEAK extern uint32_t __sram_noncacheable_start__, __sram_noncacheable_end__;

    if (((uint32_t)&__sram_noncacheable_start__) && ((uint32_t)&__sram_noncacheable_end__))
    {
        g_u32NonCacheableBase  = (uint32_t)&__sram_noncacheable_start__;
        g_u32NonCacheableLimit = DCACHE_ALIGN_LINE_SIZE((uint32_t)&__sram_noncacheable_end__) - 1;
    }

#endif

    if (g_u32NonCacheableLimit > g_u32NonCacheableBase)
    {
        /* Disable D-Cache */
        SCB_DisableDCache();
        /* Configure MPU memory attribute */
        /*
         * Attribute 0
         * Memory Type = Normal
         * Attribute   = Outer Non-cacheable, Inner Non-cacheable
         */
        ARM_MPU_SetMemAttr(eMPU_ATTR_NON_CACHEABLE, ARM_MPU_ATTR(ARM_MPU_ATTR_NON_CACHEABLE, ARM_MPU_ATTR_NON_CACHEABLE));

        /* Configure MPU memory regions */
        ARM_MPU_SetRegion((MPU_REGIONS_MAX - 1),                                                   /* Region (MPU_REGIONS_MAX - 1) */
                          ARM_MPU_RBAR((uint32_t)g_u32NonCacheableBase, ARM_MPU_SH_NON, 0, 0, 0),  /* Non-shareable, read/write, privileged, executable */
                          ARM_MPU_RLAR((uint32_t)g_u32NonCacheableLimit, eMPU_ATTR_NON_CACHEABLE)  /* Use Attr eMPU_ATTR_NON_CACHEABLE */
                         );
        /* Enable MPU */
        ARM_MPU_Enable(MPU_CTRL_PRIVDEFENA_Msk);
        /* Enable D-Cache */
        SCB_EnableDCache();
    }

#endif  // (NVT_DCACHE_ON == 1)

    return i32RetCode;
}

/*----------------------------------------------------------------------------
  System initialization function
 *----------------------------------------------------------------------------*/
//__attribute__((constructor)) void SystemInit(void)
void SystemInit(void)
{
#if  (NVT_DCACHE_ON == 1)
    /* Section .bss and .data in SRAM are initialized by CPU with runtime library after D-Cache enabled.   */
    /* Some data might be cached in D-Cache therefore clean D-Cache here to ensure all data flush to SRAM. */
    SCB_CleanDCache();
#endif

    /* Set SCB->VTOR should be in zephyr/arch/arm/core/cortex_m/scb.c, especially build with BOOTLOADER_MCUBOOT */
    //SCB->VTOR = 0x100000;

#if 0
#if defined (__VTOR_PRESENT) && (__VTOR_PRESENT == 1U)
#ifdef NVT_VECTOR_ON_FLASH
    SCB->VTOR = (uint32_t)(&__VECTOR_TABLE[0]);
#else
    SCB->VTOR = (uint32_t)(&DTCM_VECTOR_TABLE[0]);
#endif
#endif
//#endif

#ifdef UNALIGNED_SUPPORT_DISABLE
    SCB->CCR |= SCB_CCR_UNALIGN_TRP_Msk;
#endif

    /* Enable Loop and branch info cache */
    SCB->CCR |= SCB_CCR_LOB_Msk;
    __DSB();
    __ISB();
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    TZ_SAU_Setup();
    SCU_Setup();
    FMC_NSCBA_Setup();
#endif

    /* Initialize MPU setting and use default configurations. Not suitable in Zephyr. */
    //InitPreDefMPURegion(NULL, 0);
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
 * @brief    Setup Non-secure boundary
 *
 * @details  This function is used to set Non-secure boundary according to
 *           the configuration of partition header file
 */
void FMC_NSCBA_Setup(void)
{
    /* Skip NSCBA Setup according config */
    if (FMC_INIT_NSCBA == 0)
        return;

    /* Check if NSCBA value with current active NSCBA */
    if ((SCU->FNSADDR != FMC_SECURE_END) ||
            ((FMC->ISPSTS & FMC_ISPSTS_MIRBOUND_Msk) != (FMC_INIT_MIRROR_BOUND << FMC_ISPSTS_MIRBOUND_Pos))
       )
    {
        /* Unlock Protected Register */
        SYS_UnlockReg();

        /* Enable FMC ISP and config update */
        FMC->ISPCTL = FMC_ISPCTL_ISPEN_Msk | FMC_ISPCTL_CFGUEN_Msk;

        /* Config Base of NSCBA */
        FMC->ISPADDR = FMC_NSCBA_BASE;

        /* Read Non-secure base address config */
        FMC->ISPCMD = FMC_ISPCMD_READ;
        FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;

        while (FMC->ISPTRG)
            ;

        /* Setting NSCBA when it is empty */
        if (FMC->ISPDAT != 0xFFFFFFFFul)
        {
            /* Erase old setting */
            FMC->ISPCMD = FMC_ISPCMD_CFG_ERASE;
            FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;

            while (FMC->ISPTRG)
                ;
        }

        /* Set new base */
        FMC->ISPDAT = ((uint32_t)(FMC_INIT_MIRROR_BOUND << 31) | FMC_SECURE_END);
        FMC->ISPCMD = FMC_ISPCMD_PROGRAM;
        FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;

        while (FMC->ISPTRG)
            ;

