zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Source/system_M55M1.c
    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I3C0_Msk)
        NVIC_ITNS_CONF(I3C0_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UTCPD_Msk)
        NVIC_ITNS_CONF(UTCPD_IRQn);

    /* SCU_D2PNS0 */
    if (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_LPPDMA_Msk)
        NVIC_ITNS_CONF(LPPDMA_IRQn);

    if (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_CCAP_Msk)
        NVIC_ITNS_CONF(CCAP_IRQn);

    /* SCU_D2PNS2 */
    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPTMR01_Msk)
    {
        NVIC_ITNS_CONF(LPTMR0_IRQn);
        NVIC_ITNS_CONF(LPTMR1_IRQn);
    }

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_TTMR01_Msk)
    {
        NVIC_ITNS_CONF(TTMR0_IRQn);
        NVIC_ITNS_CONF(TTMR1_IRQn);
    }

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPADC0_Msk)
        NVIC_ITNS_CONF(LPADC0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPI2C0_Msk)
        NVIC_ITNS_CONF(LPI2C0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPSPI0_Msk)
        NVIC_ITNS_CONF(LPSPI0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_DMIC0_Msk)
    {
        NVIC_ITNS_CONF(DMIC0_IRQn);
        NVIC_ITNS_CONF(DMIC0VAD_IRQn);
    }

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPUART0_Msk)
        NVIC_ITNS_CONF(LPUART0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_AWF_Msk)
        NVIC_ITNS_CONF(AWF_IRQn);

    /* Set interrupt to Non-secure according to SCU_INIT_IO_ITNS_VAL settings */
    if (SCU_INIT_IO_ITNS_VAL & BIT0) NVIC_ITNS_CONF(GPA_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT1) NVIC_ITNS_CONF(GPB_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT2) NVIC_ITNS_CONF(GPC_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT3) NVIC_ITNS_CONF(GPD_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT4) NVIC_ITNS_CONF(GPE_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT5) NVIC_ITNS_CONF(GPF_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT6) NVIC_ITNS_CONF(GPG_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT7) NVIC_ITNS_CONF(GPH_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT8) NVIC_ITNS_CONF(GPI_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT9) NVIC_ITNS_CONF(GPJ_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT10) NVIC_ITNS_CONF(EINT0_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT11) NVIC_ITNS_CONF(EINT1_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT12) NVIC_ITNS_CONF(EINT2_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT13) NVIC_ITNS_CONF(EINT3_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT14) NVIC_ITNS_CONF(EINT4_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT15) NVIC_ITNS_CONF(EINT5_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT16) NVIC_ITNS_CONF(EINT6_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT17) NVIC_ITNS_CONF(EINT7_IRQn);

    /* Enable SCU Int status */
    SCU->SVIEN0 = (uint32_t)(-1);
    SCU->SVIEN1 = (uint32_t)(-1);
    NVIC_EnableIRQ(SCU_IRQn);
}

__WEAK void SCU_IRQHandler(void)
{
    uint32_t u32Reg, u32MPCBase;
    uint32_t i;
    struct mpc_sie_reg_map_t *psMPC;
    uint32_t au32MPCInfo[][3] =
    {
        { SRAM0MPC_BASE,  SRAM0_BASE,     SRAM0_SIZE     },
        { SRAM1MPC_BASE,  SRAM1_BASE,     SRAM1_SIZE     },
        { SRAM2MPC_BASE,  SRAM2_BASE,     SRAM2_SIZE     },
        { SRAM3MPC_BASE,  SRAM3_BASE,     SRAM3_SIZE     },
        { LPSRAMMPC_BASE, LPSRAM_BASE,    LPSRAM_SIZE    },
        { SPIM0MPC_BASE,  SPIM0_MEM_BASE, SPIM0_MEM_SIZE },
    };

    NVT_UNUSED(sc_astrMasterName);
    NVT_UNUSED(sc_astrMasterVioName);
    NVT_UNUSED(sc_astrSlaveName);
    u32Reg = SCU->SVINTSTS2;

    if (u32Reg)
    {
        /* Get violation address */
        for (i = 0; i < (sizeof(au32MPCInfo) / sizeof(au32MPCInfo[0])); i++)
        {
            if (u32Reg & (1 << i))
            {
                u32MPCBase = au32MPCInfo[i][0];
                psMPC = (struct mpc_sie_reg_map_t *)u32MPCBase;
                psMPC->int_clear = 1;
#if (CHECK_SCU_VIOLATION == 1)
                printf("\nMPC violation detected. (SCU_INTSTS2: 0x%08X)\n", u32Reg);
                printf("  INT_Info1: 0x%08X\n", psMPC->int_info1);
                printf("  INT_Info2: 0x%08X\n", psMPC->int_info2);

                while (1) ;

#endif
            }
        }
    }

    /* Check slave peripherals security violation interrupt */
    u32Reg = SCU->SVINTSTS0;

    if (u32Reg)
    {
        /* Get violation address and source */
        for (i = 0; i < (sizeof(sc_astrSlaveName) / sizeof(sc_astrSlaveName[0])); i++)
        {
            if (u32Reg & (1 << i))
            {
                SCU->SVINTSTS0 = (1 << i);
#if (CHECK_SCU_VIOLATION == 1)
                printf("\nSlave violation detected. (SCU_INTSTS0: 0x%08X)\n", u32Reg);
                printf("  %s access ", sc_astrMasterName[SCU->PVSRC[i]]);
                printf("%s@0x%08X illegallly.\n", sc_astrSlaveName[i], SCU->PVA[i]);

                while (1) ;

#endif
            }
        }
    }

    /* Check master peripherals (MSC) security violation interrupt */
    u32Reg = SCU->SVINTSTS1;

    if (u32Reg)
    {
        /* Get violation address */
        for (i = 0; i < (sizeof(sc_astrMasterVioName) / sizeof(sc_astrMasterVioName[0])); i++)
        {
            if (u32Reg & (1 << i))
            {
                SCU->SVINTSTS1 = (1 << i);
#if (CHECK_SCU_VIOLATION == 1)
                printf("\nMSC violation detected. (SCU_INTSTS1: 0x%08X)\n", u32Reg);
                printf("  %s access 0x%08X illegally.\n", sc_astrMasterVioName[i], SCU->MVA[i]);

                while (1) ;

#endif
            }
        }
    }
}

/**
 * @brief   Setup a Nonsecure callable Region
 *
 * @details The base and limit of Nonsecure callable region is dependent on the
 *          application code size.
 */
void NSC_Init(uint32_t u32RegionIdx)
{
    uint32_t u32Base = 0,
             u32Limit = 0;

#if defined (__ICCARM__)
# pragma section = "Veneer$$CMSE"
    u32Base  = (uint32_t)__section_begin("Veneer$$CMSE");
    u32Limit = (uint32_t)__section_end("Veneer$$CMSE");
#elif defined(__ARMCC_VERSION)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wdollar-in-identifier-extension"
    extern uint32_t Image$$NSC_ROM$$XO$$Base [];
    extern uint32_t Image$$NSC_ROM$$XO$$Limit[];
    u32Base  = (uint32_t)Image$$NSC_ROM$$XO$$Base;
    u32Limit = (uint32_t)Image$$NSC_ROM$$XO$$Limit;
#pragma clang diagnostic pop
#else
    extern uint32_t __start_NSC[];
    extern uint32_t __end_NSC[];
    u32Base  = (uint32_t)__start_NSC;
    u32Limit = (uint32_t)__end_NSC;
#endif

